Revit 2027 API
BuiltInFailures.ConnectorFailures.OpenConnector Property
 The element has an open connector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenConnector { get; }
Public Shared ReadOnly Property OpenConnector As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenConnector {
	FailureDefinitionId^ get ();
}
static member OpenConnector : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace